/* Задание 1 
Текст задания
1. Создайте массив с элементами 1, 2, 3. Выведите на экран
каждый из этих элементов.
2. Создайте массив с произвольными элементами.
Выведите на экран количество элементов в этом
массиве.
3. Создайте массив с элементами 'a', 'b', 'c'. Запишите вместо
первого элемента число 1, вместо второго - 2, вместо
третьего - 3.*/

//////////task-1////////////

const arr = [1, 2, 3];

for (let i = 0; i < arr.length; i++) {
    const element = arr[i];
    console.log(element);
}
console.log('///////////');

///////////task-2////////////

const array = [2, 5, 7, 8, 11, 0];

for (let i = 0; i < array.length; i++) {
    const element = array[i];
    console.log(array.length);
}
console.log('///////////');

///////////task-3///////////

const arr2 = ['a', 'b', 'c'];

arr2[0] = 1;
arr2[1] = 2;
arr2[2] = 3;

console.log(arr2);