/* Задание 4
1. Дан массив const arr = [2, 5, 9, 15, 1, 4];
Выведите в консоль те элементы массива, которые больше 3-х, но
меньше 10.
2. Найдите сумму четных чисел от 2 до 100.
3. Дан массив const = [2, 5, 9, 3, 1, 4];
Найдите сумму элементов этого массива.
4. С помощью цикла сформируйте строку '-1-2-3-4-5-6-7-8-9-'.
5. Дан массив с числами. const = [2, 5, 9, 0, 3, 1, 4]; Запустите цикл,
который будет по очереди выводить элементы этого массива в
консоль до тех пор, пока не встретится элемент со значением 0.
После этого цикл должен завершить свою работу.*/

/////////task-1/////////////////

const arr = [2, 5, 9, 15, 1, 4];

for (let i = 0; i < arr.length; i++) {
    let element = arr[i];
    if (element > 3 && element < 10) {
        console.log(element);
    }
}
console.log('////////////////////');

/////////task-2/////////////////
let num = 20;
let sum = 0;

for (let i = 2; i <= num; i++) {
    
    if (i % 2 === 0) {
        sum += i // sum = sum + 1
    }
}
console.log(sum);
console.log('////////////////////');

/////////task-3/////////////////

const arr2 = [2, 5, 9, 3, 1, 4];
let sum2 = 0;

for (let i = 0; i < arr2.length; i++) {
    sum2 += arr2[i];
}
console.log(sum2);
console.log('////////////////////');

/////////task-4/////////////////

let string = '-'
for (let i = 1; i < 10; i++) {
    string = string + i + '-'
}
console.log(string);
console.log('////////////////////');

/////////task-5/////////////////

const arr3 = [2, 5, 9, 0, 3, 1, 4];

for (let i = 0; i < arr3.length; i++) {
    console.log(arr3[i]);
    if (arr3[i] === 0) {
        break;
    }
}
